##### Data Analysis Project

##### Set up proper imports so there is  access to the Pandas, Matplotlib, and MySQL Connector Python libraries.

In [128]:
import pandas as pd
import matplotlib.pyplot as plt
import mysql.connector as connection

#### Use MySQL Connector to establish a connection to my remote data source

In [223]:
newdb = connection.connect(host="devcodecamp-mysql.c5p7yvjq1h8y.us-east-2.rds.amazonaws.com", database="salesdb", user="root", 
		password="D3v$tudent", use_pure=True)

salesquery = "SELECT * FROM cities"


salesdf = pd.read_sql_query(salesquery, newdb)
salesdf.head()

C:\Users\Callr\AppData\Local\Temp\ipykernel_7448\1245626389.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  salesdf = pd.read_sql_query(salesquery, newdb)

   City_ID           City
0        1        Seattle
1        2  New York City
2        3      Milwaukee

##### We want to JOIN the information from the sales and cities tables together, and save the result as a single DataFrame variable.

In [261]:
salesqueryjoin = "SELECT * FROM cities INNER JOIN sales ON cities.City_ID= sales.City_ID"

sales_df = pd.read_sql(salesqueryjoin, newdb)

sales_df

C:\Users\Callr\AppData\Local\Temp\ipykernel_7448\2440354783.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sales_df = pd.read_sql(salesqueryjoin, newdb)

,City_ID,City,Invoice_ID,Customer_Type,Gender,Product_Line,Unit_Price,Quantity,Sales_Tax,Total,Date,Time,Payment,COGS,Gross_Income,Rating
0,1,Seattle,101-17-6199,Normal,Male,Food and beverages,45.79,7,None,336.5565,3/13/2019,19:44,Credit card,320.53,16.0265,7.0
1,3,Milwaukee,101-81-4070,Member,Female,Health and beauty,62.82,2,None,131.9220,1/17/2019,12:36,Ewallet,125.64,6.2820,4.9
2,3,Milwaukee,102-06-2002,Member,Male,Sports and travel,25.25,5,None,132.5625,3/20/2019,17:52,Cash,126.25,6.3125,6.1
3,3,Milwaukee,102-77-2261,Member,Male,Health and beauty,65.31,7,None,480.0285,3/5/2019,18:02,Credit card,457.17,22.8585,4.2
4,1,Seattle,105-10-6182,Member,Male,Fashion accessories,21.48,2,None,45.1080,2/27/2019,12:22,Ewallet,42.96,2.1480,6.6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,3,Milwaukee,894-41-5205,Normal,Female,Food and beverages,43.18,8,None,362.7120,1/19/2019,19:39,Credit card,345.44,17.2720,8.3
996,2,New York City,895-03-6665,Normal,Female,Fashion accessories,36.51,9,None,345.0195,2/16/2019,10:52,Cash,328.59,16.4295,4.2
997,2,New York City,895-66-0685,Member,Male,Food and beverages,18.08,3,None,56.9520,3/5/2019,19:46,Ewallet,54.24,2.7120,8.0
998,1,Seattle,896-34-0956,Normal,Male,Fashion accessories,21.32,1,None,22.3860,1/26/2019,12:43,Cash,21.32,1.0660,5.9
999,1,Seattle,898-04-2717,Normal,Male,Fashion accessories,76.40,9,None,721.9800,3/19/2019,15:49,Ewallet,687.60,34.3800,7.5

#### We want to perform the necessary data cleaning and wrangling steps for my DataFrame.

##### Which could include the following:
#####  Exploring the information of the joined DataFrame
##### Checking for and removing null values, if necessary
##### Checking for and removing duplicate rows, if necessary

In [262]:
sales_df.info()
sales_df.duplicated()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   City_ID        1000 non-null   int64
 1   City           1000 non-null   object
 2   Invoice_ID     1000 non-null   object
 3   Customer_Type  1000 non-null   object
 4   Gender         1000 non-null   object
 5   Product_Line   1000 non-null   object
 6   Unit_Price     1000 non-null   float64
 7   Quantity       1000 non-null   int64
 8   Sales_Tax      0 non-null      object
 9   Total          1000 non-null   float64
 10  Date           1000 non-null   object
 11  Time           1000 non-null   object
 12  Payment        1000 non-null   object
 13  COGS           1000 non-null   float64
 14  Gross_Income   1000 non-null   float64
 15  Rating         1000 non-null   float64
dtypes: float64(5), int64(2), object(9)
memory usage: 125.1+ KB

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

#### Converting any necessary columns to Pandas DateTime format

In [216]:
sales_df["Date"] = pd.to_datetime(sales_df["Date"])
sales_df["Time"]=sales_df["Time"].astype("datetime64[ns]")
sales_df["Time"] = pd.to_datetime(sales_df["Time"])
sales_df.head()

,City_ID,City,Invoice_ID,Customer_Type,Gender,Product_Line,Unit_Price,Quantity,Sales_Tax,Total,Date,Time,Payment,COGS,Gross_Income,Rating
0,1,Seattle,101-17-6199,Normal,Male,Food and beverages,45.79,7,None,336.5565,2019-03-13,2023-05-22,Credit card,320.53,16.0265,7.0
1,3,Milwaukee,101-81-4070,Member,Female,Health and beauty,62.82,2,None,131.9220,2019-01-17,2023-05-22,Ewallet,125.64,6.2820,4.9
2,3,Milwaukee,102-06-2002,Member,Male,Sports and travel,25.25,5,None,132.5625,2019-03-20,2023-05-22,Cash,126.25,6.3125,6.1
3,3,Milwaukee,102-77-2261,Member,Male,Health and beauty,65.31,7,None,480.0285,2019-03-05,2023-05-22,Credit card,457.17,22.8585,4.2
4,1,Seattle,105-10-6182,Member,Male,Fashion accessories,21.48,2,None,45.1080,2019-02-27,2023-05-22,Ewallet,42.96,2.1480,6.6

#### Check: How many sales were made for members vs. normal customers?

In [250]:
salesquerysales = "SELECT  CUSTOMER_TYPE,COUNT(TOTAL) FROM sales GROUP BY CUSTOMER_TYPE"
sales_df = pd.read_sql(salesquerysales, newdb)
sales_df

C:\Users\Callr\AppData\Local\Temp\ipykernel_7448\4204441444.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sales_df = pd.read_sql(salesquerysales, newdb)

  CUSTOMER_TYPE  COUNT(TOTAL)
0        Normal           499
1        Member           501

#### Check: How many sales were made at each store location?

In [263]:
salesquerysales = "SELECT City_ID,COUNT(TOTAL) FROM sales GROUP BY City_ID"
sales_df = pd.read_sql(salesquerysales, newdb)
sales_df

C:\Users\Callr\AppData\Local\Temp\ipykernel_7448\1038572681.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sales_df = pd.read_sql(salesquerysales, newdb)

   City_ID  COUNT(TOTAL)
0        1           340
1        3           328
2        2           332